app/views/courses/_assignment_list.html.erb

SELECT "assignments".* FROM "assignments"  WHERE "assignments"."course_id" = $1  [["course_id", 1]]
---
<% @course.assignments.each do |assignment| %>